
///////////////////////////////////////////////////////////////////////////////
// ПОДГОТОВКА ТЕКСТА КОДА

&НаКлиенте
Процедура ПодготовитьТекстКода(Команда)
	
	ТекстКода = ПодготовитьПроверяемыйТекстНаСервере(ПроверяемыйТекст);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПодготовитьПроверяемыйТекстНаСервере(ТекстКода)
	
	ГотовыйТекстКода = Новый ТекстовыйДокумент;
	ГотовыйТекстКода.УстановитьТипФайла(КодировкаТекста.UTF8);
	
	ЧТ = Новый ЧтениеТекста(ПолучитьДвоичныеДанныеИзСтроки(ТекстКода, , Ложь).ОткрытьПотокДляЧтения(), КодировкаТекста.UTF8);
	
	// Строки читаются до символа перевода строки
	ТекущаяСтрока = ЧТ.ПрочитатьСтроку();
	
	Пока ТекущаяСтрока <> Неопределено Цикл 
		
		Строка = СокрЛП(ТекущаяСтрока);
		
		// Разбор строки.
		Если ЗначениеЗаполнено(Строка) Тогда
			
			Если СтрНачинаетсяС(Строка, "//") Тогда
				
				ГотовыйТекстКода.ДобавитьСтроку(Строка);
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Переход к следующей строке.
		ТекущаяСтрока = ЧТ.ПрочитатьСтроку();
		
	КонецЦикла;
	
	Возврат ГотовыйТекстКода.ПолучитьТекст();
	
КонецФункции


///////////////////////////////////////////////////////////////////////////////
// Спеллер Тест

&НаКлиенте
Процедура КомандаСпеллерТест(Команда)
	
	ОчиститьСообщения();
	
	ПроверитьОрфографию();
	
КонецПроцедуры // КомандаСпеллерТест()

&НаКлиенте
Процедура ПроверитьОрфографию()
	
	Ответ = "";
	
	мСтрок = СтрРазделить(ТекстКода, Символы.ПС, Ложь);
	
	СчСимволов = 0;
	
	врмСтрок = Новый Массив;
	
	Соединение = Новый HTTPСоединение("speller.yandex.net",80,,,,30,);
	
	Для Каждого ТекущаяСтрока Из мСтрок Цикл
		
		СчСимволов = СчСимволов + СтрДлина(ТекущаяСтрока);
		
		Если СчСимволов > 1000 Тогда
			
			ВывестиРезультат(СтрСоединить(врмСтрок, Символы.ПС), Соединение);
			
			врмСтрок.Очистить();
			
			СчСимволов = 0;
			
		Иначе // НЕ СчСимволов > 1000
			
			врмСтрок.Добавить(ТекущаяСтрока);
			
		КонецЕсли; // СчСимволов > 1000
		
	КонецЦикла; // Для Каждого ТекущаяСтрока Из мСтрок Цикл
	
	Сообщить("Готово!");
	
КонецПроцедуры // ПроверитьОрфографию()

&НаКлиенте
Процедура ВывестиРезультат(врТекстКода, Соединение)
	
	//КодыОшибок = Новый Соответствие;
	//КодыОшибок.Вставить(1, "Слова нет в словаре.");
	//КодыОшибок.Вставить(2, "Повтор слова.");
	//КодыОшибок.Вставить(3, "Неверное употребление прописных и строчных букв.");
	//КодыОшибок.Вставить(4, "Текст содержит слишком много ошибок. При этом приложение может отправить Яндекс.
	//			|Спеллеру оставшийся непроверенным текст в следующем запросе.");
	
	HTTPЗапрос = Новый HTTPЗапрос("services/spellservice.json/checkTexts?text=" + врТекстКода + "&lang=ru&options=6&format=plain");
	
	Результат = Соединение.Получить(HTTPЗапрос);
	
	Если Результат.КодСостояния = 200 Тогда
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Результат.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8));
		
		Данные = ПрочитатьJSON(ЧтениеJSON, Истина);
		
		//SpellResult — корневой элемент;
		//error — информация об ошибке (может быть несколько или могут отсутствовать);
		//word — исходное слово;
		//s — подсказка (может быть несколько или могут отсутствовать).
		//
		//Элемент <error> содержит следующие атрибуты:
		//
		//code — код ошибки, см. Коды ошибок;
		//pos — позиция слова с ошибкой (отсчет от 0);
		//row — номер строки (отсчет от 0);
		//col — номер столбца (отсчет от 0);
		//len — длина слова с ошибкой.
		
		Если ТипЗнч(Данные) = Тип("Массив") Тогда
			
			Для Каждого ТекЭлемент Из Данные Цикл
				
				Если ТипЗнч(ТекЭлемент) = Тип("Соответствие") Тогда

					Для Каждого ТекПодЭлемент Из ТекЭлемент Цикл

						Ответ = Ответ + ?(Ответ = "", "", Символы.ПС)
							+ ТекПодЭлемент["word"]
							+ " || " + СтрСоединить(ТекПодЭлемент["s"], " || ");
							//+ " => " + КодыОшибок[ТекПодЭлемент["code"]];

						// Для дальнейшего развития:
						//
						//Если ТипЗнч(ТекПодЭлемент.Значение) = Тип("Массив") Тогда
						//	
						//	Ответ = Ответ + ?(Ответ = "", "", Символы.ПС) + ТекПодЭлемент.Ключ + " = ";
						//	
						//	Для Каждого ТекПодПодЭлемент Из ТекПодЭлемент.Значение Цикл
						//		Ответ = Ответ + Символы.ПС + ТекПодПодЭлемент;
						//	КонецЦикла;
						//	
						//Иначе
						//	Ответ = Ответ + ?(Ответ = "", "", Символы.ПС)
						//			+ ТекПодЭлемент.Ключ
						//			+ " = "
						//			+ ТекПодЭлемент.Значение;
						//КонецЕсли;

					КонецЦикла; // Для Каждого ТекПодЭлемент Из ТекЭлемент Цикл
					
				КонецЕсли; // ТипЗнч(ТекЭлемент) = Тип("Соответствие")
				
			КонецЦикла; // Для Каждого ТекЭлемент Из Данные Цикл
			
		КонецЕсли; // ТипЗнч(Данные) = Тип("Массив")
		
	КонецЕсли; // Результат.КодСостояния = 200
	
КонецПроцедуры // ВывестиРезультат()

